РемонтПК_Конфигурация/src/Documents/ЗаявкаНаРемонт/ЗаявкаНаРемонт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкаНаРемонт</name>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.КлиентыСервис</types>
    </type>
  </attributes>
  <attributes>
    <name>Специалист</name>
    <type>
      <types>CatalogRef.Специалисты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПоломки</name>
    <type>
      <types>EnumRef.Проблема</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыполнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусЗаявки</types>
    </type>
  </attributes>
</mdclass:Document>

РемонтПК_Конфигурация/src/Enums/ДниНедели/ДниНедели.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ДниНедели</name>
  <enumValues>
    <name>Понедельник</name>
  </enumValues>
  <enumValues>
    <name>Вторник</name>
  </enumValues>
  <enumValues>
    <name>Среда</name>
  </enumValues>
  <enumValues>
    <name>Четверг</name>
  </enumValues>
  <enumValues>
    <name>Пятница</name>
  </enumValues>
  <enumValues>
    <name>Суббота</name>
  </enumValues>
  <enumValues>
    <name>Воскресенье</name>
  </enumValues>
</mdclass:Enum>

РемонтПК_Конфигурация/src/Documents/ЗаявкаНаРемонт/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура СпециалистПриИзменении(Элемент)
	ПроверитьГрафикСпециалиста();
КонецПроцедуры

&НаКлиенте
Процедура ДатаВыполненияПриИзменении(Элемент)
	ПроверитьГрафикСпециалиста();
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьГрафикСпециалиста()
	Если НЕ ЗначениеЗаполнено(Объект.Специалист) 
		ИЛИ НЕ ЗначениеЗаполнено(Объект.ДатаВыполнения) Тогда
		Возврат;
	КонецЕсли;
	
	РезультатПроверки = ПроверитьГрафикНаСервере(
		Объект.Специалист, Объект.ДатаВыполнения);
	
	Если НЕ РезультатПроверки Тогда
		Сообщить("Внимание: специалист " + Объект.Специалист 
			+ " не работает в выбранный день!");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПроверитьГрафикНаСервере(Специалист, ДатаВыполнения)
	
	// Определяем день недели из даты (1=Пн, 2=Вт, ... 7=Вс)
	НомерДня = ДеньНедели(ДатаВыполнения);
	
	// Получаем соответствующее значение перечисления
	ДеньПеречисления = ПолучитьДеньПеречисления(НомерДня);
	
	// Проверяем есть ли этот день в графике специалиста
	ДанныеСпециалиста = Специалист.ПолучитьОбъект();
	
	Для Каждого Строка Из ДанныеСпециалиста.График Цикл
		Если Строка.ДеньНедели = ДеньПеречисления Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

&НаСервере
Функция ПолучитьДеньПеречисления(НомерДня)
	Дни = Перечисления.ДниНедели;
	Если    НомерДня = 1 Тогда Возврат Дни.Понедельник;
	ИначеЕсли НомерДня = 2 Тогда Возврат Дни.Вторник;
	ИначеЕсли НомерДня = 3 Тогда Возврат Дни.Среда;
	ИначеЕсли НомерДня = 4 Тогда Возврат Дни.Четверг;
	ИначеЕсли НомерДня = 5 Тогда Возврат Дни.Пятница;
	ИначеЕсли НомерДня = 6 Тогда Возврат Дни.Суббота;
	ИначеЕсли НомерДня = 7 Тогда Возврат Дни.Восресенье;
	КонецЕсли;
КонецФункции
